[
  {
    "title": "Java",
    "snippet": "Java — строго типизированный объектно-ориентированный язык программирования общего назначения, разработанный компанией Sun Microsystems (в последующем",
    "pageId": 2506
  },
  {
    "title": "Java Virtual Machine",
    "snippet": "Java Virtual Machine (сокращенно Java VM, JVM) — виртуальная машина Java — основная часть исполняющей системы Java, так называемой Java Runtime Environment",
    "pageId": 109573
  },
  {
    "title": "История версий Java SE",
    "snippet": "Основная статья: Java Первый выпуск. Первой стабильной версией стала JDK 1.0 Наиболее значимые дополнения: обширное изменение событий библиотеки AWT в",
    "pageId": 109799
  },
  {
    "title": "Сервлет (Java)",
    "snippet": "Сервлет является интерфейсом Java, реализация которого расширяет функциональные возможности сервера. Сервлет взаимодействует с клиентами посредством принципа",
    "pageId": 143637
  },
  {
    "title": "Java Development Kit",
    "snippet": "разработчика приложений на языке Java, включающий в себя компилятор Java (javac), стандартные библиотеки классов Java, примеры, документацию, различные",
    "pageId": 109741
  },
  {
    "title": "Java Runtime Environment",
    "snippet": "Java Runtime Environment (сокр. JRE; русск. среда выполнения для Java) — минимальная реализация виртуальной машины, необходимая для исполнения Java-приложений",
    "pageId": 109579
  },
  {
    "title": "JavaScript",
    "snippet": "оказали влияние многие языки, при разработке была цель сделать язык похожим на Java. Языком JavaScript не владеет какая-либо компания или организация, что отличает",
    "pageId": 11922
  },
  {
    "title": "Scala (язык программирования)",
    "snippet": "платформ Java и JavaScript. По мнению Джеймса Стрэчена[en], создателя языка программирования Groovy, Scala может стать преемником языка Java. Язык был",
    "pageId": 162092
  },
  {
    "title": "Сравнение C Sharp и Java",
    "snippet": "ряд различий. Языки C# и Java появились в разное время. Язык Java был создан задолго до появления C#. Под названием Oak Java был разработан компанией",
    "pageId": 322526
  },
  {
    "title": "Java Database Connectivity",
    "snippet": "(англ. Java DataBase Connectivity — соединение с базами данных на Java) — платформенно независимый промышленный стандарт взаимодействия Java-приложений",
    "pageId": 68435
  }
]