[
  {
    "title": "Naughty Dog",
    "snippet": "Naughty Dog, LLC (ранее JAM Software, Inc.) — американская частная компания, специализирующаяся на разработке компьютерных игр. Основана в 1984 году.",
    "pageId": 2550773
  },
  {
    "title": "Dog Eat Dog",
    "snippet": "Dog Eat Dog (с англ. дословный Собака ест Собаку, смысловой «Волчьи законы» или «Человек человеку волк») — американская группа созданная в Берген (округ",
    "pageId": 1842726
  },
  {
    "title": "Hound Dog",
    "snippet": "Hound Dog (в переводе с англ. «Гончая собака») — известная песня, соответствующая музыкальным стандартам жанра рок-н-ролл, в которой главным и постоянным",
    "pageId": 179023
  },
  {
    "title": "Sen Dog",
    "snippet": "Сен Дог (англ. Sen Dog, настоящее имя — Сенен Райес (англ. Senen Reyes)) — рэпер, член известной хип-хоп-группы Cypress Hill. В дополнение к работе с",
    "pageId": 1232850
  },
  {
    "title": "Snoop Dogg",
    "snippet": "Ке́лвин Кордоза́р Бро́дус-мла́дший (англ. Calvin Cordozar Broadus Jr.; род. 20 октября 1971), более известный как Снуп Догг (англ. Snoop Dogg) — американский",
    "pageId": 276079
  },
  {
    "title": "J-Dog",
    "snippet": "Лос-Анджелес, США, наиболее известный под своим сценическим псевдонимом J-Dog) — участник рэпкор-группы Hollywood Undead. В Hollywood Undead выступает",
    "pageId": 5650816
  },
  {
    "title": "Лок Дог",
    "snippet": "Жва́кин (род. 25 января 1989, Ульяновск), более известный под псевдонимами Loc-Dog и Лок Дог — российский хип-хоп-исполнитель, бывший участник группы «Стороны",
    "pageId": 3249403
  },
  {
    "title": "Омаха-Бич",
    "snippet": "запада к востоку) под кодовыми именами Able, Baker, Charlie, Dog Green, Dog White, Dog Red, Easy Green, Easy Red, Fox Green и Fox Red. Первоначальный",
    "pageId": 1858729
  },
  {
    "title": "Собака",
    "snippet": "собаку и волка Раскрыт полный геном собаки Dog Genetic health Dog genome sequence announced — MIT News Office Dog gene map may help understand human disease —",
    "pageId": 3141841
  },
  {
    "title": "Альфа Дог",
    "snippet": "«Альфа Дог» (англ. Alpha Dog) — художественный фильм 2006 года режиссёра Ника Кассаветиса. Основан на реальной истории Джесси Джеймса Голливуда (Jesse",
    "pageId": 554015
  }
]